KOR_MAIN = {
    1:"안녕하세요", 2:"어느", 3:"만나다", 4:"비빔밥", 5:"반갑다", 6:"취미", 7:"나", 8:"영화", 9:"얼굴",
    10:"보다", 11:"이름", 12:"읽다", 13:"감사하다", 14:"마찬가지", 15:"죄송하다", 16:"먹다", 17:"괜찮다",
    18:"수고", 19:"다음", 20:"나이", 21:"또", 22:"얼마", 23:"날", 24:"좋다", 25:"언제", 26:"우리",
    27:"지하철", 28:"친절", 29:"버스", 30:"탑승", 31:"휴대전화", 32:"어디", 33:"번호", 34:"곳",
    35:"안내", 36:"감당", 37:"누구", 38:"도착", 39:"가족", 40:"시간", 41:"소개", 42:"받다",
    43:"문의", 44:"걷다", 45:"부모님", 46:"10분", 47:"여동생", 48:"공부", 49:"인간", 50:"지금",
    51:"특별한", 52:"어제", 53:"가르치다", 54:"겨루다", 55:"끝", 56:"당신", 57:"개의", 58:"결혼",
    59:"노력", 60:"아니다", 61:"땀", 62:"아직", 63:"결과", 64:"낳다", 65:"성공", 66:"당부",
    67:"서울", 68:"저녁", 69:"경험", 70:"초대", 71:"음식", 72:"내키다", 73:"방문", 74:"시간",
    75:"멀다", 76:"잘하다", 77:"신중"
}

ENG_MAIN = {
    1:"hi", 2:"what", 3:"meet", 4:"bibimbap", 5:"glad",
    6:"hobby", 7:"me", 8:"movie", 9:"face",
    10:"see", 11:"name", 12:"read", 13:"thank", 14:"equal",
    15:"sorry", 16:"eat", 17:"fine", 18:"do_effort", 19:"next",
    20:"age", 21:"again", 22:"how_many", 23:"day", 24:"good",
    25:"when", 26:"we", 27:"subway", 28:"friendly",
    29:"bus", 30:"ride", 31:"cell_phone", 32:"where",
    33:"number", 34:"location", 35:"guide", 36:"responsibility",
    37:"who", 38:"arrive", 39:"family", 40:"time",
    41:"introduction", 42:"receive", 43:"please",
    44:"walk", 45:"parents", 46:"ten_minutes", 47:"sister",
    48:"study", 49:"human", 50:"now",
    51:"special", 52:"yesterday", 53:"education", 54:"test",
    55:"end", 56:"you", 57:"worried_about", 58:"marry",
    59:"effort", 60:"no", 61:"sweat", 62:"yet",
    63:"finally", 64:"born", 65:"success", 66:"favor",
    67:"seoul", 68:"dinner", 69:"experience", 70:"invite",
    71:"food", 72:"want", 73:"visit", 74:"one_hour",
    75:"far", 76:"good", 77:"care"
}

MISSING_LABELS = {12, 19, 28, 33, 35, 45, 46, 53, 73, 75}
ACTIVE_LABELS = [i for i in range(1, 78) if i not in MISSING_LABELS]
